Smo3/Baller/src/stm32_mems_adapter.c
/******************** (C) COPYRIGHT 2009 STMicroelectronics ********************
* File Name          : stm32_mems_adapter.c
* Author             : Industrial & Multi-Market Competence Center Europe - Connectivity & Sensors Team
* Version            : V1.0.1
* Date               : 07/20/2009
* Description        : Provides functions to work with STM32-MEMS
*                      demonstration board.
********************************************************************************
* History:
* 07/20/2009: V1.0.1 I2C speed increased to 400kHz 
* 05/26/2009: V1.0.0 Initial revision
********************************************************************************
* THE PRESENT FIRMWARE WHICH IS FOR GUIDANCE ONLY AIMS AT PROVIDING CUSTOMERS
* WITH CODING INFORMATION REGARDING THEIR PRODUCTS IN ORDER FOR THEM TO SAVE TIME.
* AS A RESULT, STMICROELECTRONICS SHALL NOT BE HELD LIABLE FOR ANY DIRECT,
* INDIRECT OR CONSEQUENTIAL DAMAGES WITH RESPECT TO ANY CLAIMS ARISING FROM THE
* CONTENT OF SUCH FIRMWARE AND/OR THE USE MADE BY CUSTOMERS OF THE CODING
* INFORMATION CONTAINED HEREIN IN CONNECTION WITH THEIR PRODUCTS.
*******************************************************************************/

/* Includes ------------------------------------------------------------------*/

#include "stm32_mems.h"
#include "stm32_mems_adapter.h"
#include "stm32f10x_rcc.h"
#include "stm32f10x_gpio.h"
#include "stm32f10x_adc.h"
#include "stm32f10x_dma.h"
#include "stm32f10x_spi.h"
#include "stm32f10x_i2c.h"
#include "stm32f10x_exti.h"

#ifndef USE_STDPERIPH_DRIVER /* CMSIS compliant FW library not used */
#include "stm32f10x_nvic.h"
#endif

/* Private typedef -----------------------------------------------------------*/
/* Private define ------------------------------------------------------------*/
/* Private macro -------------------------------------------------------------*/
/* Max number of I2C flag checks */
#define I2C_MAX_CHECK_CNT 10000
/* Max number of SPI flag checks */
#define SPI_MAX_CHECK_CNT 10000
/* Private variables ---------------------------------------------------------*/

DMA_InitTypeDef DMA_InitStructure;
s16 ADC_DataValue[3];
u8 MEMS_I2C_DEVICE_ADDRESS=0;

/* Private function prototypes -----------------------------------------------*/

void MEMS_ANL_ADC_Stop(void);
void MEMS_ANL_ADC_Start(void);

ErrorStatus I2C_WaitEvent (I2C_TypeDef* I2Cx, u32 I2C_Event);

ErrorStatus SPI_I2S_WaitFlag (SPI_TypeDef* SPIx, u16 SPI_I2S_FLA,
                              FlagStatus SPI_I2S_FLAValue);

/* Private functions ---------------------------------------------------------*/


/*----------------------------------------------------------------------------*/
/*----------------------------------------------------------------------------*/
/*-------------------              Analog               ----------------------*/
/*----------------------------------------------------------------------------*/
/*----------------------------------------------------------------------------*/


/*******************************************************************************
* Function Name  : MEMS_ANL_Setup
* Description    : Setups all peripherals related to analog MEMS.
* Input          : none
* Output         : none
* Return         : none
*******************************************************************************/
void MEMS_ANL_Setup (void) {
  GPIO_InitTypeDef GPIO_InitStructure;
  ADC_InitTypeDef   ADC_InitStructure;

  /* Enable clocks -----------------------------------------------------------*/
  /* Enable ADC and GPIO clocks */
  RCC_APB2PeriphClockCmd(MEMS_ANL_RCC_APB2Periph_ADC |
                         MEMS_ANL_RCC_APB2Periph_GPIOs, ENABLE);

  /* Enable DMA clock */
  RCC_AHBPeriphClockCmd(MEMS_ANL_RCC_AHBPeriph_DMA, ENABLE);

  /* Configure GPIOs ---------------------------------------------------------*/
  /* Configure ADC_IN pins */
  GPIO_InitStructure.GPIO_Pin = MEMS_ANL_GPIO_Pin_X;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AIN;
  GPIO_Init(MEMS_ANL_GPIO_X, &GPIO_InitStructure);

  GPIO_InitStructure.GPIO_Pin = MEMS_ANL_GPIO_Pin_Y;
  GPIO_Init(MEMS_ANL_GPIO_Y, &GPIO_InitStructure);

  GPIO_InitStructure.GPIO_Pin = MEMS_ANL_GPIO_Pin_Z;
  GPIO_Init(MEMS_ANL_GPIO_Z, &GPIO_InitStructure);

  /* Configure FS for analog MEMS control */
  GPIO_InitStructure.GPIO_Pin = MEMS_ANL_GPIO_Pin_FS;
  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP;
  GPIO_Init(MEMS_ANL_GPIO_FS, &GPIO_InitStructure);

  /* Configure PD for analog MEMS control */
  GPIO_InitStructure.GPIO_Pin = MEMS_ANL_GPIO_Pin_PD;
  GPIO_Init(MEMS_ANL_GPIO_PD, &GPIO_InitStructure);

  /* Set full scale to 0 (2g) */
  MEMS_ANL_Drive_FS (Bit_RESET);
  /* Set power down to 0 (MEMS in active state) */
  MEMS_ANL_Drive_PD (Bit_RESET);

  /* ADC configuration -------------------------------------------------------*/
  ADC_InitStructure.ADC_Mode = ADC_Mode_Independent;
  ADC_InitStructure.ADC_ScanConvMode = ENABLE;
  ADC_InitStructure.ADC_ContinuousConvMode = ENABLE;
  ADC_InitStructure.ADC_ExternalTrigConv = ADC_ExternalTrigConv_None;
  ADC_InitStructure.ADC_DataAlign = ADC_DataAlign_Right;
  ADC_InitStructure.ADC_NbrOfChannel = 3;
  ADC_Init(MEMS_ANL_ADC, &ADC_InitStructure);

  /* ADC regular channel configuration */
  ADC_RegularChannelConfig(MEMS_ANL_ADC, MEMS_ANL_ADC_Channel_X,  1,
                           ADC_SampleTime_239Cycles5);
  ADC_RegularChannelConfig(MEMS_ANL_ADC, MEMS_ANL_ADC_Channel_Y,  2,
                           ADC_SampleTime_239Cycles5);
  ADC_RegularChannelConfig(MEMS_ANL_ADC, MEMS_ANL_ADC_Channel_Z,  3,
                           ADC_SampleTime_239Cycles5);

  /* Enable ADC DMA */
  ADC_DMACmd(MEMS_ANL_ADC, ENABLE);
  /* Enable ADC */
  ADC_Cmd(MEMS_ANL_ADC, ENABLE);

  /* Enable ADC reset calibaration register */
  ADC_ResetCalibration(MEMS_ANL_ADC);
  /* Check the end of ADC reset calibration register */
  while(ADC_GetResetCalibrationStatus(MEMS_ANL_ADC));

  /* Start ADC calibaration */
  ADC_StartCalibration(MEMS_ANL_ADC);
  /* Check the end of ADC calibration */
  while(ADC_GetCalibrationStatus(MEMS_ANL_ADC));

 /* DMA channel configuration ------------------------------------------------*/
  DMA_DeInit(MEMS_ANL_DMA_Channel);
  DMA_InitStructure.DMA_PeripheralBaseAddr = MEMS_ANL_ADC_DR_Address;
  DMA_InitStructure.DMA_MemoryBaseAddr = (u32)ADC_DataValue;
  DMA_InitStructure.DMA_DIR = DMA_DIR_PeripheralSRC;
  DMA_InitStructure.DMA_BufferSize = 3;
  DMA_InitStructure.DMA_PeripheralInc = DMA_PeripheralInc_Disable;
  DMA_InitStructure.DMA_MemoryInc = DMA_MemoryInc_Enable;
  DMA_InitStructure.DMA_PeripheralDataSize = DMA_PeripheralDataSize_HalfWord;
  DMA_InitStructure.DMA_MemoryDataSize = DMA_MemoryDataSize_HalfWord;
  DMA_InitStructure.DMA_Mode = DMA_Mode_Circular;
  DMA_InitStructure.DMA_Priority = DMA_Priority_High;
  DMA_InitStructure.DMA_M2M = DMA_M2M_Disable;
  DMA_Init(MEMS_ANL_DMA_Channel, &DMA_InitStructure);

  /* Enable DMA channel */
  DMA_Cmd(MEMS_ANL_DMA_Channel, ENABLE);

  /* Enable interrupt on buffer half- and full */
  DMA_ITConfig(MEMS_ANL_DMA_Channel, DMA_IT_TC, ENABLE);

