Smo3/Baller/src/stm32_mems_adapter.c
}

/*******************************************************************************
* Function Name  : MEMS_ANL_Drive_FS
* Description    : Drives FS pin of analog MEMS.
* Input          : BitVal - new value of the FS pin
* Output         : none
* Return         : none
*******************************************************************************/
void MEMS_ANL_Drive_FS (BitAction BitVal) {
  GPIO_WriteBit(MEMS_ANL_GPIO_FS, MEMS_ANL_GPIO_Pin_FS, BitVal);
}

/*******************************************************************************
* Function Name  : MEMS_ANL_Drive_PD
* Description    : Drives PD pin of analog MEMS.
* Input          : BitVal - new value of the PD pin
* Output         : none
* Return         : none
*******************************************************************************/
void MEMS_ANL_Drive_PD (BitAction BitVal) {
  GPIO_WriteBit(MEMS_ANL_GPIO_PD, MEMS_ANL_GPIO_Pin_PD, BitVal);
}

/*******************************************************************************
* Function Name  : MEMS_ANL_ADC_Stop
* Description    : Stops ADC and DMA.
* Input          : none
* Output         : none
* Return         : none
*******************************************************************************/
void MEMS_ANL_ADC_Stop(void)
{
  ADC_Cmd(MEMS_ANL_ADC, DISABLE);
  DMA_Cmd(MEMS_ANL_DMA_Channel, DISABLE);
}

/*******************************************************************************
* Function Name  : MEMS_ANL_ADC_Start
* Description    : Starts ADC and DMA.
* Input          : none
* Output         : none
* Return         : none
*******************************************************************************/
void MEMS_ANL_ADC_Start(void)
{
  DMA_Init(MEMS_ANL_DMA_Channel, &DMA_InitStructure);
  DMA_Cmd(MEMS_ANL_DMA_Channel, ENABLE);

  /* enable ADC again */
  ADC_Cmd(MEMS_ANL_ADC, ENABLE);

  /* Enable ADC reset calibaration register */
  ADC_ResetCalibration(MEMS_ANL_ADC);
  /* Check the end of ADC reset calibration register */
  while(ADC_GetResetCalibrationStatus(MEMS_ANL_ADC));

  /* Start ADC calibaration */
  ADC_StartCalibration(MEMS_ANL_ADC);
  /* Check the end of ADC calibration */
  while(ADC_GetCalibrationStatus(MEMS_ANL_ADC));

  /* Start ADC Software Conversion */
  ADC_SoftwareStartConvCmd(MEMS_ANL_ADC, ENABLE);
}

/*******************************************************************************
* Function Name  : MEMS_ANL_ADC_Restart
* Description    : Restarts ADC and DMA.
* Input          : none
* Output         : none
* Return         : none
*******************************************************************************/
void MEMS_ANL_ADC_Restart(void)
{
  MEMS_ANL_ADC_Stop();
  MEMS_ANL_ADC_Start();
}

/*******************************************************************************
* Function Name  : MEMS_ANL_Get_Axis
* Description    : Gets values of all MEMS axis.
* Input          : none
* Output         : x - Value of X axe
*                  y - Value of Y axe
*                  z - Value of Z axe
* Return         : none
*******************************************************************************/
void MEMS_ANL_Get_Axis(s16 *x, s16 *y, s16 *z)
{
  *x = ADC_DataValue[0];
  *y = ADC_DataValue[1];
  *z = ADC_DataValue[2];
}



/*----------------------------------------------------------------------------*/
/*----------------------------------------------------------------------------*/
/*-------------------              Digital              ----------------------*/
/*----------------------------------------------------------------------------*/
/*----------------------------------------------------------------------------*/

/*******************************************************************************
* Function Name  : MEMS_DIG_Setup_Int1
* Description    : Enables or disables EXTI for the Int1 interrupt signal.
* Input          : NewState: New state of the interrupt. This parameter
*                  can be: ENABLE or DISABLE.
* Output         : None
* Return         : None
*******************************************************************************/
void MEMS_DIG_Setup_Int1(FunctionalState NewState)
{
  GPIO_InitTypeDef GPIO_InitStructure;
  EXTI_InitTypeDef EXTI_InitStructure;
  NVIC_InitTypeDef NVIC_InitStructure;

  /* Initialize the EXTI_InitStructure */
  EXTI_StructInit(&EXTI_InitStructure);

  /* Disable the EXTI line */
  if(NewState == DISABLE)
  {
    EXTI_InitStructure.EXTI_Line = MEMS_DIG_EXTI_Line_Int1;
    EXTI_InitStructure.EXTI_LineCmd = DISABLE;
    EXTI_Init(&EXTI_InitStructure);
  }
  /* Enable the EXTI line */
  else
  {
    /* Enable the External Interrupt */
    NVIC_InitStructure.NVIC_IRQChannel = MEMS_DIG_EXTI_IRQn_Int1;
    NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 2;
    NVIC_InitStructure.NVIC_IRQChannelSubPriority = 1;
    NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
    NVIC_Init(&NVIC_InitStructure);

    /* Configure Int1 pin as input floating */
    GPIO_InitStructure.GPIO_Pin = MEMS_DIG_GPIO_Pin_Int1;
    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IN_FLOATING;
    GPIO_Init(MEMS_DIG_GPIO_Int1, &GPIO_InitStructure);

    /* Configure Int1 pin for external interrupt */
    GPIO_EXTILineConfig(MEMS_DIG_GPIO_PortSourceGPIO_Int1, MEMS_DIG_GPIO_PinSource_Int1);

    /* Clear the the EXTI line  */
    EXTI_ClearITPendingBit(MEMS_DIG_EXTI_Line_Int1);

    EXTI_InitStructure.EXTI_Mode = EXTI_Mode_Interrupt;
    EXTI_InitStructure.EXTI_Line = MEMS_DIG_EXTI_Line_Int1;
    EXTI_InitStructure.EXTI_Trigger = EXTI_Trigger_Rising;
    EXTI_InitStructure.EXTI_LineCmd = ENABLE;
    EXTI_Init(&EXTI_InitStructure);
  }
}

/*******************************************************************************
* Function Name  : MEMS_DIG_Setup_Int2
* Description    : Enables or disables EXTI for the Int2 interrupt signal.
* Input          : NewState: New state of the interrupt. This parameter
*                  can be: ENABLE or DISABLE.
* Output         : None
* Return         : None
*******************************************************************************/
void MEMS_DIG_Setup_Int2(FunctionalState NewState)
{
  GPIO_InitTypeDef GPIO_InitStructure;
  EXTI_InitTypeDef EXTI_InitStructure;
  NVIC_InitTypeDef NVIC_InitStructure;

