Smo3/Baller/src/stm32_mems_adapter.c
  /* Initialize the EXTI_InitStructure */
  EXTI_StructInit(&EXTI_InitStructure);

  /* Disable the EXTI line */
  if(NewState == DISABLE)
  {
    EXTI_InitStructure.EXTI_Line = MEMS_DIG_EXTI_Line_Int2;
    EXTI_InitStructure.EXTI_LineCmd = DISABLE;
    EXTI_Init(&EXTI_InitStructure);
  }
  /* Enable the EXTI line */
  else
  {
    /* Enable the External Interrupt */
    NVIC_InitStructure.NVIC_IRQChannel = MEMS_DIG_EXTI_IRQn_Int2;
    NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 2;
    NVIC_InitStructure.NVIC_IRQChannelSubPriority = 1;
    NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
    NVIC_Init(&NVIC_InitStructure);

    /* Configure Int2 pin as input floating */
    GPIO_InitStructure.GPIO_Pin = MEMS_DIG_GPIO_Pin_Int2;
    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IN_FLOATING;
    GPIO_Init(MEMS_DIG_GPIO_Int2, &GPIO_InitStructure);

    /* Configure Int2 pin for external interrupt */
    GPIO_EXTILineConfig(MEMS_DIG_GPIO_PortSourceGPIO_Int2, MEMS_DIG_GPIO_PinSource_Int2);

    /* Clear the the EXTI line  */
    EXTI_ClearITPendingBit(MEMS_DIG_EXTI_Line_Int2);

    EXTI_InitStructure.EXTI_Mode = EXTI_Mode_Interrupt;
    EXTI_InitStructure.EXTI_Line = MEMS_DIG_EXTI_Line_Int2;
    EXTI_InitStructure.EXTI_Trigger = EXTI_Trigger_Rising;
    EXTI_InitStructure.EXTI_LineCmd = ENABLE;
    EXTI_Init(&EXTI_InitStructure);
  }
}

/*----------------------------------------------------------------------------*/
/*----------------------------------------------------------------------------*/
/*-------------------               SPI                 ----------------------*/
/*----------------------------------------------------------------------------*/
/*----------------------------------------------------------------------------*/

/*******************************************************************************
* Function Name  : MEMS_SPI_Setup
* Description    : Setups all peripherals related to digital MEMS connected over SPI.
* Input          : none
* Output         : none
* Return         : none
*******************************************************************************/
void MEMS_SPI_Setup (void)
{
  GPIO_InitTypeDef GPIO_InitStructure;
  SPI_InitTypeDef  SPI_InitStructure;

  /* Enable clocks -----------------------------------------------------------*/
  /* Enable SPI and GPIO clocks */

  RCC_APB2PeriphClockCmd(MEMS_DIG_RCC_APB2Periph_GPIOs |
                         MEMS_SPI_RCC_APB2Periph_GPIOs, ENABLE);

#ifdef STM3210B_EVAL
  RCC_APB2PeriphClockCmd(MEMS_SPI_RCC_APB2Periph_SPI, ENABLE);
#endif

#ifdef STM3210E_EVAL
  RCC_APB1PeriphClockCmd(MEMS_SPI_RCC_APB1Periph_SPI, ENABLE);

  /* Disable JTAG pins PBx */
  GPIO_PinRemapConfig(GPIO_Remap_SWJ_JTAGDisable, ENABLE);
#endif

#ifdef STM3210B_SK_IAR
  RCC_APB1PeriphClockCmd(MEMS_SPI_RCC_APB1Periph_SPI, ENABLE);
#endif


  /* Configure GPIOs    ------------------------------------------------------*/
  /* Configure CS pin */
  GPIO_InitStructure.GPIO_Pin = MEMS_DIG_GPIO_Pin_CS;
  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP;
  GPIO_Init(MEMS_DIG_GPIO_CS, &GPIO_InitStructure);
  /* Drive CS pin high */
  GPIO_WriteBit(MEMS_DIG_GPIO_CS, MEMS_DIG_GPIO_Pin_CS, Bit_SET);

  /* Configure SPI pins */
  GPIO_InitStructure.GPIO_Pin = MEMS_SPI_GPIO_Pin_SCK | MEMS_SPI_GPIO_Pin_SDI |
                                MEMS_SPI_GPIO_Pin_SD0;
  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF_PP;
  GPIO_Init(MEMS_SPI_GPIO, &GPIO_InitStructure);

  /* SPI configuration -------------------------------------------------------*/
  SPI_InitStructure.SPI_Direction = SPI_Direction_2Lines_FullDuplex;
  SPI_InitStructure.SPI_Mode = SPI_Mode_Master;
  SPI_InitStructure.SPI_DataSize = SPI_DataSize_8b;
  SPI_InitStructure.SPI_CPOL = SPI_CPOL_Low;
  SPI_InitStructure.SPI_CPHA = SPI_CPHA_1Edge;
  SPI_InitStructure.SPI_NSS = SPI_NSS_Soft; /* No hardware CS generation */
  SPI_InitStructure.SPI_BaudRatePrescaler = SPI_BaudRatePrescaler_16;
  SPI_InitStructure.SPI_FirstBit = SPI_FirstBit_MSB;
  SPI_InitStructure.SPI_CRCPolynomial = 7;
  SPI_Init(MEMS_SPI, &SPI_InitStructure);

  /* Enable SPI */
  SPI_Cmd(MEMS_SPI, ENABLE);

}

/*******************************************************************************
* Function Name  : SPI_I2S_WaitFlag
* Description    : Waits till the SPI flag is set to the defined value.
* Input          : - SPIx: where x can be 1 or 2 to select the SPI peripheral.
*                  - SPI_I2S_FLA: specifies the flag to be checked.
*                  - SPI_I2S_FLAValue: specifies the flag status to be checked.
* Output         : None
* Return         : An ErrorStatus enumeration value:
*                       - SUCCESS: Flag was set correctly
*                       - ERROR: Flag was not not set correctly
*******************************************************************************/
ErrorStatus SPI_I2S_WaitFlag (SPI_TypeDef* SPIx, u16 SPI_I2S_FLA,
                              FlagStatus SPI_I2S_FLAValue)
{
  u16 i;

  for (i=0; i < SPI_MAX_CHECK_CNT; i++)
    if (SPI_I2S_GetFlagStatus(SPIx, SPI_I2S_FLA) == SPI_I2S_FLAValue)
      return SUCCESS;

  return ERROR;
}

/*******************************************************************************
* Function Name  : MEMS_SPI_SendFrame
* Description    : Sends one frame over SPI.
* Input          : - RegAddress: Address of register.
*                  - pBuffer: Pointer to buffer with data.
*                  - NoOfBytes: Number of bytes to be sent.
* Output         : none
* Return         : An ErrorStatus enumeration value:
*                       - SUCCESS: Frame was sent
*                       - ERROR: Frame was not sent
*******************************************************************************/
ErrorStatus MEMS_SPI_SendFrame (u8 RegAddress, u8 *pBuffer, u8 NoOfBytes)
{
  u8 i;
  u8 addr = RegAddress + MEMS_SPI_WRITE;

  if (NoOfBytes > 1)
    addr += MEMS_SPI_MULTIPLE_BYTES;

  /* Drive SSEL-manual pin */
  GPIO_WriteBit(MEMS_DIG_GPIO_CS, MEMS_DIG_GPIO_Pin_CS, Bit_RESET);

  /* Send address byte */
  if (SPI_I2S_WaitFlag(MEMS_SPI, SPI_I2S_FLAG_TXE, SET) != SUCCESS) return ERROR;

