Smo3/Baller/src/stm32_mems_adapter.c
  SPI_I2S_SendData(MEMS_SPI, addr);
  if (SPI_I2S_WaitFlag(MEMS_SPI, SPI_I2S_FLAG_RXNE, SET) != SUCCESS) return ERROR;
  SPI_I2S_ReceiveData(MEMS_SPI);

  /* Send data bytes */
  for(i=0; i < NoOfBytes; i++) {
    if (SPI_I2S_WaitFlag(MEMS_SPI, SPI_I2S_FLAG_TXE, SET) != SUCCESS) return ERROR;
    SPI_I2S_SendData(MEMS_SPI, *(pBuffer+i));
    if (SPI_I2S_WaitFlag(MEMS_SPI, SPI_I2S_FLAG_RXNE, SET) != SUCCESS) return ERROR;
    /* Empty receive FIFO */
    SPI_I2S_ReceiveData(MEMS_SPI);
  }

  /* Drive SSEL-manual pin */
  GPIO_WriteBit(MEMS_DIG_GPIO_CS, MEMS_DIG_GPIO_Pin_CS, Bit_SET);

  return SUCCESS;
}

/*******************************************************************************
* Function Name  : MEMS_SPI_ReceiveFrame
* Description    : Receives one frame over SPI.
* Input          : - RegAddress: Address of source register.
*                  - NoOfBytes: Number of bytes to be received.
* Output         : - pBuffer: Pointer to output buffer.
* Return         : An ErrorStatus enumeration value:
*                       - SUCCESS: Frame was received
*                       - ERROR: Frame was not received
*******************************************************************************/
ErrorStatus MEMS_SPI_ReceiveFrame (u8 RegAddress, u8 *pBuffer, u8 NoOfBytes)
{
  u8 i;
  u16 addr = RegAddress + MEMS_SPI_READ;
  u16 dummy = 0xAA58;

  if (NoOfBytes > 1)
    addr += MEMS_SPI_MULTIPLE_BYTES;

  /* Drive SSEL-manual pin */
  GPIO_WriteBit(MEMS_DIG_GPIO_CS, MEMS_DIG_GPIO_Pin_CS, Bit_RESET);

  /* Send Address byte */
  if (SPI_I2S_WaitFlag(MEMS_SPI, SPI_I2S_FLAG_TXE, SET) != SUCCESS) return ERROR;
  SPI_I2S_SendData(MEMS_SPI, addr);
  if (SPI_I2S_WaitFlag(MEMS_SPI, SPI_I2S_FLAG_RXNE, SET) != SUCCESS) return ERROR;
  SPI_I2S_ReceiveData(MEMS_SPI); /* skip byte received with the address */

  /* Receive Data byte(s) */
  for(i=0; i < NoOfBytes; i++) {
    if (SPI_I2S_WaitFlag(MEMS_SPI, SPI_I2S_FLAG_TXE, SET) != SUCCESS) return ERROR;
    SPI_I2S_SendData(MEMS_SPI, dummy); /* send dummy byte to generate clock */
    if (SPI_I2S_WaitFlag(MEMS_SPI, SPI_I2S_FLAG_RXNE, SET) != SUCCESS) return ERROR;
    *(pBuffer+i) = SPI_I2S_ReceiveData(MEMS_SPI);
  }

  /* Drive SSEL-manual pin */
  GPIO_WriteBit(MEMS_DIG_GPIO_CS, MEMS_DIG_GPIO_Pin_CS, Bit_SET);

  return SUCCESS;
}

/*******************************************************************************
* Function Name  : MEMS_SPI_WriteReg
* Description    : Writes data to register of MEMS over SPI.
* Input          : - RegAddress: Address of register.
*                  - Data: Data to be written.
* Output         : none
* Return         : An ErrorStatus enumeration value:
*                       - SUCCESS: Register was written
*                       - ERROR: Register was not written
*******************************************************************************/
ErrorStatus MEMS_SPI_WriteReg (u8 RegAddress, u8 Data)
{
  return MEMS_SPI_SendFrame (RegAddress, &Data, 1);
}

/*******************************************************************************
* Function Name  : MEMS_SPI_ReadReg
* Description    : Reads data to register of MEMS over SPI.
* Input          : - RegAddress: Address of register.
* Output         : - Data: Data read.
* Return         : An ErrorStatus enumeration value:
*                       - SUCCESS: Register was read
*                       - ERROR: Register was not read
*******************************************************************************/
ErrorStatus MEMS_SPI_ReadReg (u8 RegAddress, u8 *Data)
{
  return MEMS_SPI_ReceiveFrame (RegAddress, Data, 1);
}

/*----------------------------------------------------------------------------*/
/*----------------------------------------------------------------------------*/
/*-------------------               I2C                 ----------------------*/
/*----------------------------------------------------------------------------*/
/*----------------------------------------------------------------------------*/

/*******************************************************************************
* Function Name  : MEMS_I2C_Setup
* Description    : Setups all peripherals related to digital MEMS connected over I2C.
* Input          : MEMS_I2C_Address - I2C address of MEMS.
* Output         : none
* Return         : none
*******************************************************************************/
void MEMS_I2C_Setup (u8 MEMS_I2C_Address)
{
  GPIO_InitTypeDef GPIO_InitStructure;
  I2C_InitTypeDef  I2C_InitStructure;

  /* Store I2C address of the MEMS sensor */
  MEMS_I2C_Set_Address (MEMS_I2C_Address);

  /* Enable clocks -----------------------------------------------------------*/
  /* Enable I2C and GPIO clocks */
  RCC_APB1PeriphClockCmd(MEMS_I2C_RCC_APB1Periph_I2C, ENABLE);

  RCC_APB2PeriphClockCmd(MEMS_DIG_RCC_APB2Periph_GPIOs |
                         MEMS_SPI_RCC_APB2Periph_GPIOs |
                         MEMS_I2C_RCC_APB2Periph_GPIOs, ENABLE);

#ifdef STM3210E_EVAL
  /* Remap pins used by MEMS */
  /* I2C1_SCL on PB.08, I2C1_SDA on PB.09 */
  GPIO_PinRemapConfig(GPIO_Remap_I2C1, ENABLE);

  /* Disable JTAG pins PBx */
  GPIO_PinRemapConfig(GPIO_Remap_SWJ_JTAGDisable, ENABLE);
#endif

  /* Configure GPIOs    ------------------------------------------------------*/
  /* Configure I2C  pins     -------------------------------------------------*/
  GPIO_InitStructure.GPIO_Pin = MEMS_I2C_GPIO_Pin_SCL | MEMS_I2C_GPIO_Pin_SDA;
  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF_OD;
  GPIO_Init(MEMS_I2C_GPIO, &GPIO_InitStructure);

  /* Configure CS and SDO for I2C MEMS control*/
  /* Configure CS pin */
  GPIO_InitStructure.GPIO_Pin = MEMS_DIG_GPIO_Pin_CS;
  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP;
  GPIO_Init(MEMS_DIG_GPIO_CS, &GPIO_InitStructure);
  /* Drive CS pin high */
  GPIO_WriteBit(MEMS_DIG_GPIO_CS, MEMS_DIG_GPIO_Pin_CS, Bit_SET);

  /* Configure SDO pin */
  GPIO_InitStructure.GPIO_Pin = MEMS_SPI_GPIO_Pin_SD0;
  GPIO_Init(MEMS_SPI_GPIO, &GPIO_InitStructure);
  /* Drive SDO (LSB of I2C address) pin low */
  GPIO_WriteBit(MEMS_SPI_GPIO, MEMS_SPI_GPIO_Pin_SD0, Bit_RESET);

  /* I2C configuration -------------------------------------------------------*/
  I2C_InitStructure.I2C_Mode = I2C_Mode_I2C;
  I2C_InitStructure.I2C_DutyCycle = I2C_DutyCycle_2;
  I2C_InitStructure.I2C_OwnAddress1 = 0x0A;
  I2C_InitStructure.I2C_Ack = I2C_Ack_Enable;
  I2C_InitStructure.I2C_AcknowledgedAddress = I2C_AcknowledgedAddress_7bit;
  I2C_InitStructure.I2C_ClockSpeed = 400000;
  I2C_Init(MEMS_I2C, &I2C_InitStructure);

  /* Enable I2C */
  I2C_Cmd (MEMS_I2C, ENABLE);

