Smo3/Baller/src/stm32_mems_adapter.c
}

/*******************************************************************************
* Function Name  : MEMS_I2C_Set_address
* Description    : Sets address of MEMS for I2C communication.
* Input          : MEMS_I2C_Address - I2C address of MEMS.
* Output         : none
* Return         : none
*******************************************************************************/
void MEMS_I2C_Set_Address (u8 MEMS_I2C_Address)
{
    MEMS_I2C_DEVICE_ADDRESS = MEMS_I2C_Address;
}

/*******************************************************************************
* Function Name  : I2C_WaitEvent
* Description    : Waits till the last I2Cx Event is equal to the one passed
*                  as parameter.
* Input          : - I2Cx: where x can be 1 or 2 to select the I2C peripheral.
*                  - I2C_EVENT: specifies the event to be checked.
* Output         : None
* Return         : An ErrorStatus enumeration value:
*                       - SUCCESS: Last event is equal to the I2C_EVENT
*                       - ERROR: Last event is different from the I2C_EVENT
*******************************************************************************/
ErrorStatus I2C_WaitEvent (I2C_TypeDef* I2Cx, u32 I2C_Event)
{
  u16 i;

  for (i=0; i < I2C_MAX_CHECK_CNT; i++)
    if (I2C_CheckEvent(I2Cx, I2C_Event) == SUCCESS)
        return SUCCESS;

  return ERROR;
}

/*******************************************************************************
* Function Name  : MEMS_I2C_SendFrame
* Description    : Sends one frame over I2C.
* Input          : - RegAddress: Address of register.
*                  - pBuffer: Pointer to buffer with data.
*                  - NoOfBytes: Number of bytes to be sent.
* Output         : none
* Return         : An ErrorStatus enumeration value:
*                       - SUCCESS: Frame sent.
*                       - ERROR: Frame was not sent.
*******************************************************************************/
ErrorStatus MEMS_I2C_SendFrame (u8 RegAddress, u8 *pBuffer, u8 NoOfBytes)
{
  u16 i;

  /* Send START condition */
  I2C_GenerateSTART(MEMS_I2C, ENABLE);
  /* Test on EV5 and clear it */
  if (I2C_WaitEvent(MEMS_I2C, I2C_EVENT_MASTER_MODE_SELECT) != SUCCESS) return ERROR;
  /* Send slave address for write */
  I2C_Send7bitAddress(MEMS_I2C,MEMS_I2C_DEVICE_ADDRESS, I2C_Direction_Transmitter);
  /* Test on EV6 and clear it */
  if (I2C_WaitEvent(MEMS_I2C, I2C_EVENT_MASTER_TRANSMITTER_MODE_SELECTED) != SUCCESS)
    return ERROR;
  I2C_SendData (MEMS_I2C, RegAddress);
  if (I2C_WaitEvent(MEMS_I2C, I2C_EVENT_MASTER_BYTE_TRANSMITTED) != SUCCESS) return ERROR;
  /* While there is data to be written */
  while (NoOfBytes-- > 0)
  {
    /* Send the current byte */
    I2C_SendData (MEMS_I2C, *pBuffer);
    if (I2C_WaitEvent(MEMS_I2C, I2C_EVENT_MASTER_BYTE_TRANSMITTED) != SUCCESS) return ERROR;
    /* Point to the next byte to be written */
    pBuffer++;
  }

  /* Send STOP condition */
  I2C_GenerateSTOP(MEMS_I2C, ENABLE);
  /* Make sure that the STOP bit is cleared by Hardware before CR1 write access */
  for (i=0; i < I2C_MAX_CHECK_CNT; i++)
    if ((MEMS_I2C->CR1&0x200) != 0x200) break;
  if ((MEMS_I2C->CR1&0x200) == 0x200) return ERROR;

  return SUCCESS;
}

/*******************************************************************************
* Function Name  : MEMS_I2C_ReceiveFrame
* Description    : Receives one frame over I2C.
* Input          : - RegAddress: Address of source register.
*                  - NoOfBytes: Number of bytes to be received.
* Output         : - pBuffer: Pointer to output buffer.
* Return         : An ErrorStatus enumeration value:
*                       - SUCCESS: Frame transmitted.
*                       - ERROR: Frame was not transmitted.
*******************************************************************************/
ErrorStatus MEMS_I2C_ReceiveFrame (u8 RegAddress, u8 *pBuffer, u8 NoOfBytes)
{
  u16 i;
  u8 addr = RegAddress;

  if (NoOfBytes > 1) {
    I2C_AcknowledgeConfig (MEMS_I2C, ENABLE);
    addr += MEMS_I2C_REPETIR;
  } else
    I2C_AcknowledgeConfig (MEMS_I2C, DISABLE);

  /* StartBit */
  I2C_GenerateSTART(MEMS_I2C, ENABLE);
  if (I2C_WaitEvent(MEMS_I2C, I2C_EVENT_MASTER_MODE_SELECT) != SUCCESS) return ERROR;

  /* Send Address of device & TRANSMITTER mode */
  I2C_Send7bitAddress(MEMS_I2C, MEMS_I2C_DEVICE_ADDRESS, I2C_Direction_Transmitter);
  if (I2C_WaitEvent(MEMS_I2C, I2C_EVENT_MASTER_TRANSMITTER_MODE_SELECTED) != SUCCESS)
    return ERROR;

  /* Send Register address */
  I2C_SendData (MEMS_I2C, addr);
  if (I2C_WaitEvent(MEMS_I2C, I2C_EVENT_MASTER_BYTE_TRANSMITTED) != SUCCESS) return ERROR;

  /* Repeat StartBit */
  I2C_GenerateSTART(MEMS_I2C, ENABLE);
  if (I2C_WaitEvent(MEMS_I2C, I2C_EVENT_MASTER_MODE_SELECT) != SUCCESS) return ERROR;

  /* Send Address of device & RECEIVER mode */
  I2C_Send7bitAddress(MEMS_I2C, MEMS_I2C_DEVICE_ADDRESS, I2C_Direction_Receiver);
  if (I2C_WaitEvent(MEMS_I2C, I2C_EVENT_MASTER_RECEIVER_MODE_SELECTED) != SUCCESS)
    return ERROR;

  /* Receive bytes */
  for (i=0;i<NoOfBytes;i++)
  {
    if (i==(NoOfBytes-2))
      I2C_AcknowledgeConfig (MEMS_I2C, DISABLE);

    if (i==(NoOfBytes-1)) /* StopBit */
      I2C_GenerateSTOP (MEMS_I2C, ENABLE);

    if (I2C_WaitEvent(MEMS_I2C, I2C_EVENT_MASTER_BYTE_RECEIVED) != SUCCESS) return ERROR;

    *(pBuffer+i) = I2C_ReceiveData(MEMS_I2C);
  }

  /* Make sure that the STOP bit is cleared by Hardware before CR1 write access */
  for (i=0; i < I2C_MAX_CHECK_CNT; i++)
    if ((MEMS_I2C->CR1&0x200) != 0x200) break;
  if ((MEMS_I2C->CR1&0x200) == 0x200) return ERROR;

  return SUCCESS;
}

/*******************************************************************************
* Function Name  : MEMS_I2C_WriteReg
* Description    : Writes data to register of MEMS over I2C.
* Input          : - RegAddress: Address of register.
*                  - Data: Data to be written.
* Output         : none
* Return         : An ErrorStatus enumeration value:
*                       - SUCCESS: Data was written.
*                       - ERROR: Data was not written.
*******************************************************************************/
ErrorStatus MEMS_I2C_WriteReg (u8 RegAddress, u8 Data)
{
  return MEMS_I2C_SendFrame (RegAddress, &Data, 1);
}

/*******************************************************************************
* Function Name  : MEMS_I2C_ReadReg
* Description    : Reads data from register of MEMS over I2C.
* Input          : - RegAddress: Address of register.
* Output         : - Data: Data read.
* Return         : An ErrorStatus enumeration value:
*                       - SUCCESS: Data was read.
*                       - ERROR: Data was not read.
*******************************************************************************/
ErrorStatus MEMS_I2C_ReadReg (u8 RegAddress, u8 *Data)
{
  return MEMS_I2C_ReceiveFrame (RegAddress, Data, 1);
}

/******************* (C) COPYRIGHT 2009 STMicroelectronics *****END OF FILE****/
